// 1 
/* let num = 10;
num++; 
++num;
num--;
alert(num);  */

// 2
/* let str = "Привет";
let num = 123;
let flag = true;
let txt = "true";
console.log(typeof str, typeof num, typeof flag, typeof txt); */

// 3
let a = 3;
let b = 5;


/* Напишите программу, которая сравнит 2 числа и выведет в алерт наименьшее. */
// 4
/* Создайте три переменные a1, a2, a3 и положите в них числа (желательно использовать
как положительные так и отрицательные числа). Используя условные операторы найдите знаки этих чисел (это может быть - или ничего).
Результат должен быть выведен через alert, который содержит сообщение
следующего вида: Знаки чисел a1, a2, a3: -, ,- (например a1 = -14, a2 = 10, a3 = -12); */
// 5
/* Спросить у пользователя возраст
Спросить у пользователя пол(через диалог confirm)
Если возраст старше 60 и пол мужской, то вывести в консоль - вы дедушка
Если возраст от 20 до 60 и пол мужской, то вывести в консоль - вы мужчина
если возраст от 12 до 20 и пол мужской - вы юноша
младше 12 и пол мужской - вы мальчик
такой же алгоритм для женщин(бабушка, женщина, девушка, девочка)
 */
// 6
/* Написать функцию, которая будет высчитывать сумму чисел от нуля, 
до параметра, который мы в неё передаем, 
например: getSum(100) должна передавать сумму чисел от 0 до 100 (должно получится 5050) */

// 7
/*Напишите скрипт, который считает количество секунд в неделе и 
показывает это количество в модальном окне. */
/* Сообщение в модальном окне должно быть таким: 'Сегодня (здесь вставить день выполнения задания) и узнал что колиство секунд одной неделе составляет (высчитанное количество)'' */
