// 1 
/* let num = 10;
num++; 
++num;
num--;
alert(num);  */

// 2
/* let str = "Привет";
let num = 123;
let flag = true;
let txt = "true";
console.log(typeof str, typeof num, typeof flag, typeof txt); */

// 3
/* let a = 6;
let b = 5;
if (a<=b) {
    alert (a)
} else {
   alert (b) 
} */

// 4
/* let a1 = 100;
let a2 = -10;
let a3 = 22;
if (a1>=0) {
   a1 = "+" 
} else  {
   a1 = "-"
}
if (a2>=0) {
    a2 = "+" 
 } else  {
   a2 = "-"
 }
 if (a3>=0) {
    a3 = "+" 
 } else  {
    a3 = "-"
 }
alert ("Знаки чисел а1, а2, а3:  " +(a1)+ " , " +(a2)+" , " +(a3)); */

// 5
let youAge = confirm("Сколько Вам лет?");


/* Спросить у пользователя возраст
Спросить у пользователя пол(через диалог confirm)
Если возраст старше 60 и пол мужской, то вывести в консоль - вы дедушка
Если возраст от 20 до 60 и пол мужской, то вывести в консоль - вы мужчина
если возраст от 12 до 20 и пол мужской - вы юноша
младше 12 и пол мужской - вы мальчик
такой же алгоритм для женщин(бабушка, женщина, девушка, девочка)
 */
// 6
/* Написать функцию, которая будет высчитывать сумму чисел от нуля, 
до параметра, который мы в неё передаем, 
например: getSum(100) должна передавать сумму чисел от 0 до 100 (должно получится 5050) */

// 7
/*Напишите скрипт, который считает количество секунд в неделе и 
показывает это количество в модальном окне. */
/* Сообщение в модальном окне должно быть таким: 'Сегодня (здесь вставить день выполнения задания) и узнал что колиство секунд одной неделе составляет (высчитанное количество)'' */
